In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('supershops.csv')

In [3]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# Normalization

In [40]:
from sklearn.preprocessing import MinMaxScaler
mi = MinMaxScaler()

In [41]:
df_mar = mi.fit(df[['Marketing Spend']])

In [42]:
df_mar

MinMaxScaler()

In [7]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [43]:
#fit and transform
df[['Administration']] = mi.fit_transform(df[['Administration']])

In [44]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.651744  471784.10    Dhaka  192261.83
1         1.452113        0.761972  443898.53      Ctg  191792.06
2         1.303634        0.379579  407934.54  Rangpur  191050.39
3         1.156567        0.512998  383199.62    Dhaka  182901.99
4         1.119836        0.305328  366168.42  Rangpur  166187.94

In [45]:

x = df.drop('Profit', axis=1)
y = df[['Profit']]

In [46]:
x1 = x.copy()
x2 = x.copy()
x3 = x.copy()
x4 = x.copy()
x5 = x.copy()
x6 = x.copy()

# Min Max Scaler Use for Loop

In [15]:
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744  471784.10    Dhaka
1         0.983359        0.761972  443898.53      Ctg
2         0.927985        0.379579  407934.54  Rangpur
3         0.873136        0.512998  383199.62    Dhaka
4         0.859438        0.305328  366168.42  Rangpur

In [16]:
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744  471784.10    Dhaka
1         0.983359        0.761972  443898.53      Ctg
2         0.927985        0.379579  407934.54  Rangpur
3         0.873136        0.512998  383199.62    Dhaka
4         0.859438        0.305328  366168.42  Rangpur

In [17]:
scaler = MinMaxScaler()

for col in x.columns:
    if pd.api.types.is_numeric_dtype(x[col]):
        x[col] = scaler.fit_transform(x[[col]])
        continue

print(x.head())

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

# Standard Scaler

In [18]:
from sklearn.preprocessing import StandardScaler
s = StandardScaler()

In [19]:

df_mar = s.fit(df[['Marketing Spend']])

In [20]:
df_mar

StandardScaler()

In [21]:
#df_mar = s.fit(df[['Marketing Spend']]) # trainging

In [22]:
df[['Marketing Spend']] = s.fit_transform(df[['Marketing Spend']])

In [23]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.651744  471784.10    Dhaka  192261.83
1         1.955860        0.761972  443898.53      Ctg  191792.06
2         1.754364        0.379579  407934.54  Rangpur  191050.39
3         1.554784        0.512998  383199.62    Dhaka  182901.99
4         1.504937        0.305328  366168.42  Rangpur  166187.94

# Use for Loop

In [24]:
x1.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744  471784.10    Dhaka
1         0.983359        0.761972  443898.53      Ctg
2         0.927985        0.379579  407934.54  Rangpur
3         0.873136        0.512998  383199.62    Dhaka
4         0.859438        0.305328  366168.42  Rangpur

In [25]:
scaler = StandardScaler()


for col in x1.columns:
    if pd.api.types.is_numeric_dtype(x1[col]):
        x1[col] = scaler.fit_transform(x1[[col]])
        continue

print(x1.head())

# Max abs scaler

In [26]:
from sklearn.preprocessing import MaxAbsScaler
mx = MaxAbsScaler()

In [27]:

df_mar = mx.fit(df[['Marketing Spend']])

In [28]:
df_mar

MaxAbsScaler()

In [29]:
df[['Marketing Spend']] = mx.fit_transform(df[['Marketing Spend']])

In [30]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.445303        0.651744  471784.10    Dhaka  192261.83
1         0.969971        0.761972  443898.53      Ctg  191792.06
2         0.870043        0.379579  407934.54  Rangpur  191050.39
3         0.771065        0.512998  383199.62    Dhaka  182901.99
4         0.746344        0.305328  366168.42  Rangpur  166187.94

# Use for loop

In [31]:
x2.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744  471784.10    Dhaka
1         0.983359        0.761972  443898.53      Ctg
2         0.927985        0.379579  407934.54  Rangpur
3         0.873136        0.512998  383199.62    Dhaka
4         0.859438        0.305328  366168.42  Rangpur

In [32]:
scaler = MaxAbsScaler()

for col in x2.columns:
    if pd.api.types.is_numeric_dtype(x2[col]):
        x2[col] = scaler.fit_transform(x2[[col]])
        continue

print(x2.head())

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

# Robust Scaler

In [33]:
from sklearn.preprocessing import RobustScaler
R =  RobustScaler()

In [34]:
df_mar = R.fit(df[['Marketing Spend']])

In [35]:
df_mar

RobustScaler()

In [36]:
df[['Marketing Spend']] = R.fit_transform(df[['Marketing Spend']])

In [37]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.651744  471784.10    Dhaka  192261.83
1         1.452113        0.761972  443898.53      Ctg  191792.06
2         1.303634        0.379579  407934.54  Rangpur  191050.39
3         1.156567        0.512998  383199.62    Dhaka  182901.99
4         1.119836        0.305328  366168.42  Rangpur  166187.94

# Use for loop

In [38]:

x3.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744  471784.10    Dhaka
1         0.983359        0.761972  443898.53      Ctg
2         0.927985        0.379579  407934.54  Rangpur
3         0.873136        0.512998  383199.62    Dhaka
4         0.859438        0.305328  366168.42  Rangpur

In [39]:
scaler = RobustScaler()

for col in x3.columns:
    if pd.api.types.is_numeric_dtype(x3[col]):
        x3[col] = scaler.fit_transform(x3[[col]])
        continue

print(x3.head())

   Marketing Spend  Administration  Transport     Area
0         0.672530        0.345355   1.552016    Dhaka
1         1.452113        0.697565   1.383714      Ctg
2         1.303634       -0.524290   1.166654  Rangpur
3         1.156567       -0.097977   1.017368    Dhaka
4         1.119836       -0.761543   0.914576  Rangpur

In [ ]:
x3 = x.copy()
x4 = x.copy()
x5 = x.copy()
x6 = x.copy()

# Use for loop